# Задача 4: 
# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

j = input ("Введите общее количество сделанных журавликов: ")
j = int (j)

k = int (j/3*2) #сколько журавликов сделала Катя
s = int (j/3/2)
p = int (j/3/2)

print (f"Катя сделала {k} журавликов(а), Сережа и Петя сделали по {s}")


nums=int(input("введите количество журавликов: "))
print(var := nums // 3 //2, var * 4, var)